### IMPORT NECESSARY MODULES

In [1]:
import pandas as pd

###  Import both the data sets “Cust_data” & “Cust_Demo” into python and solve the below questions using functions from “pandas” module.

In [2]:
cust_data=pd.read_csv("D:/Analytics Labs(Data Science with Python)/Class 7 File + Panas Study Case/4. Pandas Case Study-2/Cust_data.csv")
cust_data.head()

,ID,SeriousDlqin2yrs,RevolvingUtilization,No_of_30_59_DPD,DebtRatio,MonthlyIncome,No_Of_OpenCreditLines,No_of_90_DPD,No_of_RealEstateLoans,No_of_60_89_DPD
0,83236,0,0.311726,0,0.296409,11500.0,12,0,3,0
1,2503,0,0.124988,0,0.115903,14166.0,13,0,1,0
2,137013,0,0.060258,0,0.515147,6733.0,7,0,3,0
3,51306,0,0.064322,0,0.165127,13316.0,10,0,1,0
4,71937,0,0.211186,0,0.022283,2557.0,3,0,0,0

In [3]:
cust_demo=pd.read_csv("D:/Analytics Labs(Data Science with Python)/Class 7 File + Panas Study Case/4. Pandas Case Study-2/Cust_demo.csv")
cust_demo.head()

,ID,Location,Gender,age,Martial_Status,NumberOfDependents,Own_House,No_Years_address
0,4532,"Gandhinagar,Gujarat",0,39,Single,1.0,1,3
1,148736,"Hyderabad,Andhra Pradesh",0,52,Married,0.0,0,3
2,95965,"Shimla,Himachal Pradesh",0,62,Married,0.0,0,2
3,61759,"Srinagar,JK",0,42,Single,1.0,1,1
4,49806,"Imphal,Manipur",0,41,Single,1.0,0,3

### 1. Create sub set of cust_demo as “cust_s1” with ID, age, Gender and Location variables using the condition marital_status = “Married” and Own_house = 1 and age>28.

In [4]:
cust_s1=cust_demo[(cust_demo.Martial_Status=='Married')&(cust_demo.Own_House==1)&(cust_demo.age>=28)]

In [5]:
cust_s1.drop(['Martial_Status','NumberOfDependents','Own_House','No_Years_address'],axis=1,inplace=True)

C:\Users\raghu\Anaconda3\lib\site-packages\pandas\core\frame.py:3694: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

In [6]:
cust_s1.head()

        ID                   Location  Gender  age
28   26404        Kolkata,West Bengal       0   33
42  137858         Chennai,Tamil Nadu       0   34
50   57715  Thiruvananthapuram,Kerala       1   39
52   76230         Chandigarh,Haryana       1   53
56    8493           Ranchi,Jharkhand       1   78

### 2. Sort the cust_s1 dataset using location in ascending order and age in descending order with in the location.

In [7]:
cust_s1.sort_values(by=['Location','age'],ascending=[True,False]).head()

            ID          Location  Gender  age
83512   106073  Agartala,Tripura       1   90
49124     8967  Agartala,Tripura       1   88
65242    44249  Agartala,Tripura       1   87
148381   28287  Agartala,Tripura       0   86
64155    60165  Agartala,Tripura       0   85

### 3. Rename the variable “NumberOfDependents” as “No_of_dependents” in cust_demo data.

In [8]:
cust_demo.rename(columns={'NumberOfDependents':'No_of_dependents'}).head()

,ID,Location,Gender,age,Martial_Status,No_of_dependents,Own_House,No_Years_address
0,4532,"Gandhinagar,Gujarat",0,39,Single,1.0,1,3
1,148736,"Hyderabad,Andhra Pradesh",0,52,Married,0.0,0,3
2,95965,"Shimla,Himachal Pradesh",0,62,Married,0.0,0,2
3,61759,"Srinagar,JK",0,42,Single,1.0,1,1
4,49806,"Imphal,Manipur",0,41,Single,1.0,0,3

### 4. Remove duplicates from the both data sets Cust_data & Cust_Demo

In [9]:
cust_data.drop_duplicates(inplace=True)

In [10]:
cust_demo.drop_duplicates(inplace=True)

### 5. Create new variable as
* “No_of_30_plus_DPD = No_of_30_59_DPD+No_of_90_DPD+ No_of_60_89_DPD”,
* “No_of_60_plus_DPD = No_of_90_DPD+ No_of_60_89_DPD” in cust_data.

In [11]:
cust_data['No_of_30_plus_DPD']=cust_data.No_of_30_59_DPD+cust_data.No_of_90_DPD+cust_data.No_of_60_89_DPD

In [12]:
cust_data['No_of_60_plus_DPD']=cust_data.No_of_90_DPD+cust_data.No_of_60_89_DPD

In [13]:
cust_data.head()

,ID,SeriousDlqin2yrs,RevolvingUtilization,No_of_30_59_DPD,DebtRatio,MonthlyIncome,No_Of_OpenCreditLines,No_of_90_DPD,No_of_RealEstateLoans,No_of_60_89_DPD,No_of_30_plus_DPD,No_of_60_plus_DPD
0,83236,0,0.311726,0,0.296409,11500.0,12,0,3,0,0,0
1,2503,0,0.124988,0,0.115903,14166.0,13,0,1,0,0,0
2,137013,0,0.060258,0,0.515147,6733.0,7,0,3,0,0,0
3,51306,0,0.064322,0,0.165127,13316.0,10,0,1,0,0,0
4,71937,0,0.211186,0,0.022283,2557.0,3,0,0,0,0,0

### 6. Perform below joins between cust_data & cust_demo.
*  a. Create data set “cust_leftjoin” using Left Join
*  b. Create data set “cust_rightjoin” using right Join 
*  c. Create data set “cust_innterjoin” using inner Join
*  d. Create data set “cust_fulljoin” using full Join

In [22]:
cust_leftjoin=cust_data.set_index('ID').join(cust_demo.set_index('ID'),how='left')

In [24]:
cust_rightjoin=cust_data.set_index('ID').join(cust_demo.set_index('ID'),how='right')

In [25]:
cust_innerjoin=cust_data.set_index('ID').join(cust_demo.set_index('ID'),how='inner')

In [71]:
cust_fulljoin=cust_data.set_index('ID').join(cust_demo.set_index('ID'),how='outer')

### 7. Create two data sets by taking random sample from cust_demo with 5% data in first data set and 10000 observations in second data set

In [30]:
cust_demo_5per=cust_demo.sample(frac=.05,random_state=123)

In [31]:
cust_demo_10k=cust_demo.sample(n=10000,random_state=123)

### 8. Calculate “number of customers” and “number of married customer” using combined data set comes from left join of cust_data and cust_demo

In [42]:
cust_leftjoin.SeriousDlqin2yrs.count()  ## Number of Customers

149902

In [43]:
cust_leftjoin[cust_leftjoin.Martial_Status=='Married'].SeriousDlqin2yrs.count() ## Number of Married Customers

42819

In [55]:
cust_leftjoin.SeriousDlqin2yrs.isnull().sum() ## We can calculate above parmameters by SeriousDlqin2yers because it has no missing values

0

### 9. Create summary report with below column by combination of Gender, Serious_delinquency. 
* a. Number of customers 
* b. Percentage of customers 
* c. Average Revolving utilization 
* d. Standard deviation with in the utilization 
* e. Average monthly income  
* f. Maximum Monthly income 
* g. Standard deviation with in the income
* h. Average Age 
* i. Average Dependents

In [73]:
cust_fulljoin.reset_index(drop=False,inplace=True)

In [108]:
avg=cust_fulljoin[['Gender','SeriousDlqin2yrs','RevolvingUtilization','MonthlyIncome','age','NumberOfDependents']].groupby(['Gender','SeriousDlqin2yrs']).agg('mean').add_prefix('avg_')

In [109]:
count=cust_fulljoin[['Gender','SeriousDlqin2yrs','ID']].groupby(['Gender','SeriousDlqin2yrs']).agg('count').add_prefix('count_')

In [110]:
std=cust_fulljoin[['Gender','SeriousDlqin2yrs','RevolvingUtilization','MonthlyIncome']].groupby(['Gender','SeriousDlqin2yrs']).agg('std').add_prefix('std_')

In [112]:
max_=cust_fulljoin[['Gender','SeriousDlqin2yrs','MonthlyIncome']].groupby(['Gender','SeriousDlqin2yrs']).agg('max').add_prefix('max_')

In [124]:
per=count.groupby(level=0).apply(lambda x: x/x.sum() * 100)
per.rename(columns={'count_ID':'per_cust'},inplace=True)

In [127]:
pd.concat([avg,count,std,max_,per],axis=1)

                         avg_RevolvingUtilization  avg_MonthlyIncome  \
Gender SeriousDlqin2yrs
0.0    0.0                               7.279863        6676.964828
       1.0                               5.295516        5522.818565
1.0    0.0                               4.332912        6866.835622
       1.0                               2.813082        5811.826739

                           avg_age  avg_NumberOfDependents  count_ID  \
Gender SeriousDlqin2yrs
0.0    0.0               52.750403                0.743642     87381
       1.0               45.684110                0.929393      6287
1.0    0.0               52.754413                0.742653     52462
       1.0               46.335300                0.981426      3728

                         std_RevolvingUtilization  std_MonthlyIncome  \
Gender SeriousDlqin2yrs
0.0    0.0                             288.877443        8950.773701
       1.0                             145.701505        4669.707578
1.0    0.0                             189.815316       21260.060839
       1.0                             104.605013        8077.034775

                         max_MonthlyIncome   per_cust
Gender SeriousDlqin2yrs
0.0    0.0                        835040.0  93.287996
       1.0                         81000.0   6.712004
1.0    0.0                       3008750.0  93.365368
       1.0                        250000.0   6.634632

### 10. Create summary report with below information
* Number of married customers
* Percentage of married customers

In [131]:
cust_fulljoin[cust_fulljoin.Martial_Status=='Married']

In [134]:
cust_married=cust_fulljoin[['Martial_Status','ID']].groupby('Martial_Status').count()

In [163]:
per_cust_married=cust_married.groupby(level=0).apply(lambda x: x/cust_fulljoin.Martial_Status.notna().sum() * 100)
per_cust_married.rename(columns={'ID':'Per_ID'},inplace=True)

In [164]:
pd.concat([cust_married,per_cust_married],axis=1)

                    ID     Per_ID
Martial_Status
Married          42845  28.571714
Single          107111  71.428286